arikyueh/Dual-Channel-Oscilloscope/PsoC/LabProject.svd
        <register>
          <name>ADC_DSM_CR3</name>
          <description>Delta Sigma Modulator Control Register 3</description>
          <addressOffset>0x40005883</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>sign</name>
              <description>Invert sign of input.</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SIGN_NONINVERT</name>
                  <description>keep original polarity for the input.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIGN_INVERT</name>
                  <description>Invert sign of input (use when trying to chop once and then average the offset value out).</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>mx_dout</name>
              <description>Select DSM dout routed to UDB.</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MX_DOUT_8BIT</name>
                  <description>Select reg OUT0=dout[7:0] (synced; w/o post processing).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MX_DOUT_2SCOMP</name>
                  <description>Select reg OUT1={2'b0,ovdcause,ovdflag,dout2scomp} (synced; overload cause, overload flag, dout 2s complement.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>modbitin_en</name>
              <description>modbitin enable.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MODBITIN_EN_DISABLE</name>
                  <description>Do not allow modbit input to be mixed with modulator input.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODBITIN_EN_ENABLE</name>
                  <description>Allow modbit input to be mixed with modulator input.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>mx_modbitin</name>
              <description>Select modbitin input.</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MX_MODBITIN_LUT0</name>
                  <description>lut0_out.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MX_MODBITIN_LUT1</name>
                  <description>lut1_out.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MX_MODBITIN_LUT2</name>
                  <description>lut2_out.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MX_MODBITIN_LUT3</name>
                  <description>lut3_out.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MX_MODBITIN_LUT4</name>
                  <description>lut4_out (doesn't exist on Leopard, tied to 0).</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MX_MODBITIN_LUT5</name>
                  <description>lut5_out (doesn't exist on Leopard, tied to 0).</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MX_MODBITIN_LUT6</name>
                  <description>lut6_out (doesn't exist on Leopard, tied to 0).</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MX_MODBITIN_LUT7</name>
                  <description>lut7_out (doesn't exist on Leopard, tied to 0).</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MX_MODBITIN_UDB</name>
                  <description>UDB.</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MX_MODBITIN_CONST1</name>
                  <description>constant 1.</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MX_MODBITIN_CONST0</name>
                  <description>constant 0.</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MX_MODBITIN_0xB_RSVD</name>
                  <description>Reserved.</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MX_MODBITIN_0xC_RSVD</name>
                  <description>Reserved.</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MX_MODBITIN_0xD_RSVD</name>
                  <description>Reserved.</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MX_MODBITIN_0xE_RSVD</name>
                  <description>Reserved.</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MX_MODBITIN_0xF_RSVD</name>
                  <description>Reserved.</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_DSM_CR4</name>
          <description>Delta Sigma Modulator Control Register 4</description>
          <addressOffset>0x40005884</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>fcap1_en</name>
              <description>Enable/Disable Capacitance path meant for DFT (Design for Testability) of the first integrator's integrating capacitance path.</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FCAP1_EN_DISABLE</name>
                  <description>Disable the DFT 100fF capacitance path.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FCAP1_EN_ENABLE</name>
                  <description>Enable the DFT 100fF capacitance path.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>fcap1</name>
              <description>binary weighted first stage integrating capacitance.</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FCAP1_MIN</name>
                  <description>0 fF.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FCHOP_MAX</name>
                  <description>Max Value = 12.7 pF.</description>
                  <value>127</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FCAP1_BIT0</name>
                  <description>fcap[0] set -&gt; +100 fF.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FCAP1_BIT1</name>
                  <description>fcap[1] set -&gt; +200 fF.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FCAP1_BIT2</name>
                  <description>fcap[2] set -&gt; +400 fF.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FCAP1_BIT3</name>
                  <description>fcap[3] set -&gt; +800 fF.</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FCAP1_BIT4</name>
                  <description>fcap[4] set -&gt; +1600 fF.</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FCAP1_BIT5</name>
                  <description>fcap[5] set -&gt; +3200 fF.</description>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FCAP1_BIT6</name>
                  <description>fcap[6] set -&gt; +6400 fF.</description>
                  <value>64</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_DSM_CR5</name>
          <description>Delta Sigma Modulator Control Register 5</description>
          <addressOffset>0x40005885</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>ipcap1_en</name>
              <description>Enable/Disable Capacitance path meant for DFT (Design for Testability) of the first integrator's input sampling path.</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IPCAP1_EN_DISABLE</name>
                  <description>Disable the DFT 100fF capacitance path.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IPCAP1_EN_ENABLE</name>
                  <description>Enable the DFT 100fF capacitance path.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ipcap1</name>
              <description>Binary weighted first stage integrating capacitance.</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IPCAP1_MIN</name>
                  <description>0 fF.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IPCHOP_MAX</name>
                  <description>Max Value = 12.7 pF.</description>
                  <value>127</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IPCAP1_BIT0</name>
                  <description>ipcap[0] set -&gt; +100 fF.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IPCAP1_BIT1</name>
                  <description>ipcap[1] set -&gt; +200 fF.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IPCAP1_BIT2</name>
                  <description>ipcap[2] set -&gt; +400 fF.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IPCAP1_BIT3</name>
                  <description>ipcap[3] set -&gt; +800 fF.</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IPCAP1_BIT4</name>
                  <description>ipcap[4] set -&gt; +1600 fF.</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IPCAP1_BIT5</name>
                  <description>ipcap[5] set -&gt; +3200 fF.</description>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IPCAP1_BIT6</name>
                  <description>ipcap[6] set -&gt; +6400 fF.</description>
                  <value>64</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_DSM_CR6</name>
          <description>Delta Sigma Modulator Control Register 6</description>
          <addressOffset>0x40005886</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>daccap_en</name>
              <description>Enable/Disable Capacitance path meant for DFT (Design for Testability) of the DAC Reference sampling path.</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DACCAP_EN_DISABLE</name>
                  <description>Disable the DFT 12fF capacitance path.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DACCAP_EN_ENABLE</name>
                  <description>Enable the DFT 12fF capacitance path.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>daccap</name>
              <description>Binary weighted first stage DAC capacitance.</description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DACCAP_BIT0</name>
                  <description>daccap[0] set -&gt; add 12*8= +96 fF.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DACCAP_BIT1</name>
                  <description>daccap[1] set -&gt; add 24*8= +192 fF.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DACCAP_BIT2</name>
                  <description>daccap[2] set -&gt; add 50*8= +400 fF.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DACCAP_BIT3</name>
                  <description>daccap[3] set -&gt; add 100*8= +800 fF.</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DACCAP_BIT4</name>
                  <description>daccap[4] set -&gt; add 200*8= +1600 fF.</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DACCAP_BIT5</name>
                  <description>daccap[5] set -&gt; add 400*8= +3200 fF.</description>
                  <value>32</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_DSM_CR7</name>
          <description>Delta Sigma Modulator Control Register 7</description>
          <addressOffset>0x40005887</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>fcap2_en</name>
              <description>Enable/Disable additional 50fF capacitance path in the second integrators integrating capacitance path.</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FCAP2_EN_DISABLE</name>
                  <description>Disable the additional 50fF capacitance path.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FCAP2_EN_ENABLE</name>
                  <description>Enable the additional 50fF capacitance path.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>fcap3_en</name>
              <description>Enable/Disable additional capacitance path in the third integrator's integrating capacitance path.</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FCAP3_EN_DISABLE</name>
                  <description>Disable the additional 100fF capacitance path.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FCAP3_EN_ENABLE</name>
                  <description>Enable the additional 100fF capacitance path.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ipcap1offset</name>
              <description>Offset capacitance for the input sampling capacitance in the first stage integrator.</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IPCAP1OFFSET_0</name>
                  <description>Don't add offset capacitance.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IPCAP1OFFSET_1</name>
                  <description>Add offset capacitance of 4.8 pF.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>fcap1offset</name>
              <description>Offset Capacitance for the integrating capacitance in the first stage integrator.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FCAP1OFFSET_0</name>
                  <description>Don't add offset capacitance.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FCAP1OFFSET_1</name>
                  <description>Add offset capacitance of 3.4 pF.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>rescap_en</name>
              <description>Reserved. The resonator loop feature has been disabled in the design; programming these bits does not produce any change in the ADC outcome.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>rescap</name>
              <description>Reserved. The resonator loop feature has been disabled in the design; programming these bits does not produce any change in the ADC outcome.</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
