arikyueh/Dual-Channel-Oscilloscope/PsoC/LabProject.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>ADC_SAR</name>
      <description>SAR ADC</description>
      <baseAddress>0x0</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x0</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>SAR_TR0</name>
          <description>SAR trim register</description>
          <addressOffset>0x40004614</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
        </register>
        <register>
          <name>SAR_CSR0</name>
          <description>SAR status and control register 0</description>
          <addressOffset>0x40005900</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
        </register>
        <register>
          <name>SAR_CSR1</name>
          <description>SAR status and control register 1</description>
          <addressOffset>0x40005901</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
        </register>
        <register>
          <name>SAR_CSR2</name>
          <description>SAR status and control register 2</description>
          <addressOffset>0x40005902</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
        </register>
        <register>
          <name>SAR_CSR3</name>
          <description>SAR status and control register 3</description>
          <addressOffset>0x40005903</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
        </register>
        <register>
          <name>SAR_CSR4</name>
          <description>SAR status and control register 4</description>
          <addressOffset>0x40005904</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
        </register>
        <register>
          <name>SAR_CSR5</name>
          <description>SAR status and control register 5</description>
          <addressOffset>0x40005905</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
        </register>
        <register>
          <name>SAR_CSR6</name>
          <description>SAR status and control register 6</description>
          <addressOffset>0x40005906</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
        </register>
        <register>
          <name>SAR_SW0</name>
          <description>SAR Analog Routing Register 0</description>
          <addressOffset>0x40005B20</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
        </register>
        <register>
          <name>SAR_SW2</name>
          <description>SAR Analog Routing Register 2</description>
          <addressOffset>0x40005B22</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
        </register>
        <register>
          <name>SAR_SW3</name>
          <description>SAR Analog Routing Register 3</description>
          <addressOffset>0x40005B23</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
        </register>
        <register>
          <name>SAR_SW4</name>
          <description>SAR Analog Routing Register 4</description>
          <addressOffset>0x40005B24</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
        </register>
        <register>
          <name>SAR_SW6</name>
          <description>SAR Analog Routing Register 6</description>
          <addressOffset>0x40005B26</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
        </register>
        <register>
          <name>SAR_CLK</name>
          <description>SAR Clock Selection Register</description>
          <addressOffset>0x40005B27</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
        </register>
        <register>
          <name>SAR_WRK</name>
          <description>SAR working register</description>
          <addressOffset>0x40005BA0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>ADC_SAR_1</name>
      <description>SAR ADC</description>
      <baseAddress>0x0</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x0</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>SAR_TR0</name>
          <description>SAR trim register</description>
          <addressOffset>0x40004616</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
        </register>
        <register>
          <name>SAR_CSR0</name>
          <description>SAR status and control register 0</description>
          <addressOffset>0x40005908</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
        </register>
        <register>
          <name>SAR_CSR1</name>
          <description>SAR status and control register 1</description>
          <addressOffset>0x40005909</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
        </register>
        <register>
          <name>SAR_CSR2</name>
          <description>SAR status and control register 2</description>
          <addressOffset>0x4000590A</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
        </register>
        <register>
          <name>SAR_CSR3</name>
          <description>SAR status and control register 3</description>
          <addressOffset>0x4000590B</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
        </register>
        <register>
          <name>SAR_CSR4</name>
          <description>SAR status and control register 4</description>
          <addressOffset>0x4000590C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
        </register>
        <register>
          <name>SAR_CSR5</name>
          <description>SAR status and control register 5</description>
          <addressOffset>0x4000590D</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
        </register>
        <register>
          <name>SAR_CSR6</name>
          <description>SAR status and control register 6</description>
          <addressOffset>0x4000590E</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
        </register>
        <register>
          <name>SAR_SW0</name>
          <description>SAR Analog Routing Register 0</description>
          <addressOffset>0x40005B28</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
        </register>
        <register>
          <name>SAR_SW2</name>
          <description>SAR Analog Routing Register 2</description>
          <addressOffset>0x40005B2A</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
        </register>
        <register>
          <name>SAR_SW3</name>
          <description>SAR Analog Routing Register 3</description>
          <addressOffset>0x40005B2B</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
        </register>
        <register>
          <name>SAR_SW4</name>
          <description>SAR Analog Routing Register 4</description>
          <addressOffset>0x40005B2C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
        </register>
        <register>
          <name>SAR_SW6</name>
          <description>SAR Analog Routing Register 6</description>
          <addressOffset>0x40005B2E</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
        </register>
        <register>
          <name>SAR_CLK</name>
          <description>SAR Clock Selection Register</description>
          <addressOffset>0x40005B2F</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
        </register>
        <register>
          <name>SAR_WRK</name>
          <description>SAR working register</description>
          <addressOffset>0x40005BA2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>